name: "WideAndDeepModel"
node {
  name: "embed_c1"
  op: "Variable"
  device: "CPU"
  attr {
    key: "type"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "source_node"
    value {
      b: True
    }
  }
  attr {
    key: "source_node_type"
    value {
      source_node_type: W
    }
  }
  attr {
    key: "embedding_size"
    value {
      i: 8
    }
  }
  attr {
    key: "col_id"
    value {
      i: 1
    }
  }
}
node {
  name: "x_c1"
  op: "Placeholder"
  device: "CPU"
  attr {
    key: "source_node"
    value {
      b: True
    }
  }
  attr {
    key: "source_node_type"
    value {
      source_node_type: X
    }
  }
  attr {
    key: "col_id"
    value {
      i: 1
    }
  }
  attr {
    key: "feature_type"
    value {
      feature_type: SPARSE
    }
  }
}
node {
  name: "row_offset_c1"
  op: "Placeholder"
  device: "CPU"
  attr {
    key: "source_node"
    value {
      b: True
    }
  }
  attr {
    key: "source_node_type"
    value {
      source_node_type: OFFSET
    }
  }
  attr {
    key: "col_id"
    value {
      i: 1
    }
  }
  attr {
    key: "type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "embed_c1*x_c1"
  op: "Multiply"
  device: "CPU"
  input: "embed_c1"
  input: "x_c1"
}
node {
  name: "embedding_c1"
  op: "SegmentSum"
  device: "CPU"
  input: "embed_c1*x_c1"
  input: "row_offset_c1"
}
node {
  name: "embed_c2"
  op: "Variable"
  device: "CPU"
  attr {
    key: "type"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "source_node"
    value {
      b: True
    }
  }
  attr {
    key: "source_node_type"
    value {
      source_node_type: W
    }
  }
  attr {
    key: "col_id"
    value {
      i: 2
    }
  }
  attr {
    key: "embedding_size"
    value {
      i: 8
    }
  }
}
node {
  name: "x_c2"
  op: "Placeholder"
  device: "CPU"
  attr {
    key: "source_node"
    value {
      b: True
    }
  }
  attr {
    key: "source_node_type"
    value {
      source_node_type: X
    }
  }
  attr {
    key: "col_id"
    value {
      i: 2
    }
  }
  attr {
    key: "feature_type"
    value {
      feature_type: SPARSE
    }
  }
}
node {
  name: "row_offset_c2"
  op: "Placeholder"
  device: "CPU"
  attr {
    key: "source_node"
    value {
      b: True
    }
  }
  attr {
    key: "source_node_type"
    value {
      source_node_type: OFFSET
    }
  }
  attr {
    key: "col_id"
    value {
      i: 2
    }
  }
  attr {
    key: "type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "embed_c2*x_c2"
  op: "Multiply"
  device: "CPU"
  input: "embed_c2"
  input: "x_c2"
}
node {
  name: "embedding_c2"
  op: "SegmentSum"
  device: "CPU"
  input: "embed_c2*x_c2"
  input: "row_offset_c2"
}
node {
  name: "c1_linear"
  op: "Variable"
  device: "CPU"
  attr {
    key: "source_node"
    value {
      b: True
    }
  }
  attr {
    key: "source_node_type"
    value {
      source_node_type: W
    }
  }
  attr {
    key: "col_id"
    value {
      i: 1
    }
  }
  attr {
    key: "feature_type"
    value {
      feature_type: SPARSE
    }
  }
  attr {
    key: "embedding_size"
    value {
      i: 1
    }
  }
}
node {
  name: "x_c3"
  op: "Placeholder"
  device: "CPU"
  attr {
    key: "source_node"
    value {
      b: True
    }
  }
  attr {
    key: "source_node_type"
    value {
      source_node_type: X
    }
  }
  attr {
    key: "col_id"
    value {
      i: 3
    }
  }
  attr {
    key: "feature_type"
    value {
      feature_type: SPARSE
    }
  }
}
node {
  name: "row_offset_c3"
  op: "Placeholder"
  device: "CPU"
  attr {
    key: "source_node"
    value {
      b: True
    }
  }
  attr {
    key: "source_node_type"
    value {
      source_node_type: OFFSET
    }
  }
  attr {
    key: "col_id"
    value {
      i: 3
    }
  }
  attr {
    key: "type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "c3_linear"
  op: "Variable"
  device: "CPU"
  attr {
    key: "source_node"
    value {
      b: True
    }
  }
  attr {
    key: "source_node_type"
    value {
      source_node_type: W
    }
  }
  attr {
    key: "col_id"
    value {
      i: 3
    }
  }
  attr {
    key: "feature_type"
    value {
      feature_type: SPARSE
    }
  }
  attr {
    key: "embedding_size"
    value {
      i: 1
    }
  }
}
node {
  name: "label"
  op: "Placeholder"
  device: "CPU"
  attr {
    key: "label"
    value {
      b: True
    }
  }
}
node {
  name: "concat_embed"
  op: "Concat"
  device: "CPU"
  input: "embedding_c1"
  input: "embedding_c2"
  attr {
    key: "row_major"
    value {
      b: True
    }
  }
}
node {
  name: "concat_linear"
  op: "Concat"
  device: "CPU"
  input: "c1_linear"
  input: "c3_linear"
  attr {
    key: "row_major"
    value {
      b: True
    }
  }
}
node {
  name: "b_layer1"
  op: "Variable"
  device: "CPU"
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
          name: "rows"
        }
        dim {
          size: 10
          name: "cols"
        }
      }
    }
  }
  attr {
    key: "type"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "w_layer1"
  op: "Variable"
  device: "CPU"
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 10
          name: "layer1"
        }
        dim {
          size: 16
          name: "layer0"
        }
      }
    }
  }
  attr {
    key: "type"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "w_layer1*concat_embed"
  op: "MatMul"
  input: "concat_embed"
  input: "w_layer1"
  device: "CPU"
  attr {
    key: "type"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: False
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: True
    }
  }
}
node {
  name: "z_deep"
  op: "Add"
  input: "w_layer1*concat_embed"
  input: "b_layer1"
  device: "CPU"
  attr {
    key: "row_major"
    value {
      b: True
    }
  }
}
node {
  name: "reduce_sum_z_deep"
  op: "ReduceSum"
  input: "z_deep"
  device: "CPU"
  attr {
    key: "row_major"
    value {
      b: True
    }
  }
}
node {
  name: "reduce_sum_z_linear"
  op: "ReduceSum"
  input: "concat_linear"
  device: "CPU"
  attr {
    key: "row_major"
    value {
      b: True
    }
  }
}
node {
  name: "sum_embed_linear"
  op: "Add"
  input: "reduce_sum_z_deep"
  input: "reduce_sum_z_linear"
  device: "CPU"
  attr {
    key: "row_major"
    value {
      b: True
    }
  }
}
node {
  name: "y"
  op: "sigmoid"
  input: "sum_embed_linear"
  device: "CPU"
  attr {
    key: "row_major"
    value {
      b: True
    }
  }
}
node {
  name: "loss"
  op: "sigmoid_cross_entropy_with_logits"
  input: "label"
  input: "sum_embed_linear"
  device: "CPU"
  attr {
    key: "row_major"
    value {
      b: True
    }
  }
}
node {
  name: "yy"
  op: "sigmoid"
  input: "y"
  device: "CPU"
  attr {
    key: "row_major"
    value {
      b: True
    }
  }
  attr {
    key: "used_backward"
    value {
      b: False
    }
  }
}
version: 1
